---
kind: property
id: P:Autodesk.Revit.DB.Revolution.Sketch
source: html/38264451-ef82-f142-436c-6cd3c3df34f6.htm
---
# Autodesk.Revit.DB.Revolution.Sketch Property

Returns the Sketch of the Revolution.

## Syntax (C#)
```csharp
public Sketch Sketch { get; }
```

## Remarks
This property is used to retrieve the Sketch of the Revolution.